IDEA StatiCa Open Model
HangingAroundPatch.LegsLength Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Length of legs
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double LegsLength { get; set; }
Public Property LegsLength As Double
	Get
	Set
public:
property double LegsLength {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
HangingAroundPatch Class
IdeaRS.OpenModel.Detail Namespace